{"pages":[{"title":"关于","text":"学习计划 书单","link":"/about/index.html"},{"title":"分类","text":"","link":"/categories/index.html"},{"title":"标签","text":"","link":"/tags/index.html"}],"posts":[{"title":"Git操作","text":"本地操作 git init：初始化本地库 git status：查看工作区、暂存区的状态 git add ：将工作区的“新建/修改”添加到暂存区git rm –cached ：移除暂存区的修改 git commit -m “提交日志” ：文件从暂存区到本地库 远程操作git clone &lt;远程库地址&gt;：克隆远程库 git push &lt;别名&gt; &lt;分支名&gt;：本地库某个分支推送到远程库，分支必须指定 git push -u origin mastergit pull &lt;别名&gt; &lt;分支名&gt;：把远程库的修改拉取到本地 git pull origin mastergit pull –rebase origin master remote方式 查看 git remote -v修改 git remote set-url origin","link":"/2020/03/21/Git%E6%93%8D%E4%BD%9C/"},{"title":"Linux常用命令","text":"Cat 查看 Df 查看磁盘容量 Du 查看目录容量 du -h -d 1 Ssh vim Ls cp rm cat pwd mkdir Find 查找文件 grep 搜索文件内容 Which 查看命令位置 Tar 打包压缩 Apt-get ubuntu 包管理 /brew mac","link":"/2020/03/21/Linux%E5%B8%B8%E7%94%A8%E5%91%BD%E4%BB%A4/"},{"title":"Mysql常用命令","text":"mysql -uroot -p exit/quit; use mysql; –连接权限数据库 flush privileges; – 刷新权限 net start mysql create database db_name; – 创建数据库 show databases; – 显示所有的数据库 drop database db_name; – 删除数据库 use db_name; – 选择数据库 create table tb_name (字段名 varchar(20), 字段名 char(1)); – 创建数据表模板 show tables; – 显示数据表 desc tb_name； – 显示表结构 drop table tb_name； – 删除表","link":"/2020/04/04/Mysql%E5%B8%B8%E7%94%A8%E5%91%BD%E4%BB%A4/"},{"title":"基金评价绩效归因","text":"一、 投资理论的发展 现代投资理论诞生于 1952 年，Markowitz在《金融学期刊》上发表了题为《投资组合选择》的论文，这是学术界第一次采用计量经济学的方法度量证券投资组合的收益与风险的关系，也就是有名的“均值—方差”模型。该模型在初始前提假设条件下成功的度量了投资组合的风险，为构建有效投资组合奠定了重要的理论基础。此后，Sharpe、Treynor 和Jensen 分别在该理论基础上发展出了资本资产定价模型、Sharpe 指数、Treynor指数和 Jensen 指数。 Treynor(1965)首次提出了风险调整收益绩效评价的概念，他认为科学有效的构建投资组合完全可以消除单一投资所造成的非系统性风险，那么基金的风险可以完全由系统性风险代表。那么就可以用基金每一单位超额收益所承担的风险来衡量基金绩效水平。T=（Rp―Rf）/βp Sharpe(1966)指出由于基金经理的管理能力有所不同，因此不同的基金经理对于基金运营过程中可以消除风险程度也不同，绝大部分基金根本无法完全消除非系统性风险，因此，Sharpe 改进了 Treynor 指数，采用标准差来衡量总风险进而生成了 Sharpe 指数。 Jensen(1968)在资本资产定价模型(CAPM)的基础上，建立资本市场线，并以此为基础计算基金的超额收益率，进而检验基金绩效是否优于市场的基准水平。由于 Jensen 指数是一种绝对数指标，因此该方法无法衡量不同类型基金的绩效水平 Sortino 和 Meer(199l)指出以标准差的波动率来衡量风险水平实际上并不符合投资者的对于风险的理解和需求，他们提出 Sortino 率，他们用基金低于基准收益率(或平均收益率)的标准差来度量投资风险，此时的风险是指被评价基金的收益率低于基准收益率的不确定性。 Desai(1997)尝试通过数据包络分析(DEA)方法来构建基于多投入多产出的基金绩效评价体系，实证研究表明该方法最大的好处在于在评价过程中，不需要对投资者的投资偏好进行预先设定，而且可以充分考虑资金的运营成本，但这一方法也有缺陷，即对于评价体系的指标有强依赖性，指标一旦变化，则评价结果很难保持异质性。 Fama 和French(1992)建立了三因素模型和五因素模型，其中三因素模型确定了影响基金绩效的的因素：大盘指数、市净率以及公司规模。五因素模型在三因素模型的基础上加入了债券到期期限和信用风险溢价两个变量。 Steven Ross(1976)将资本资产定价模型发展为套利定价模型(APT)。该模型认为资产的收益并不仅受到投资组合内部风险要素的影响，还受到例如经济增长、行业周期、通胀水平等等其他因素的综合影响。套利定价模型理论上很完美，但由于驱动资产价格的因素太多，且完全依赖投资者自主选择变量，因此主观性过强，其理论价值高于实际应用价值 Franco Modigliani 和 Leah Modigliani(1997) 在此基础上有发展除了 M²风险调整绩效指数(RAP)，他们在评价基金绩效时，首先获得该组合的收益率和风险，再以市场风险为基准调整组合的风险，使其等价，并以新调整过的风险为依据对收益率进行二次生成，最终获取基金的绩效值。 Goodwin(1998)提出了信息率 (Information Ratio)的概念，该值以主动管理为调整收益基础，它不同于 Sharpe 指数，该值可以测算每单位超额收益需要承担的非系统风险。因此，该值越大，则基金经理跟踪误差获得的超额收益就越高，基金绩效也就越好 Scholz 和 Wilkens(2000)在风险调整绩效指数(RAP)基础上又提出了市场风险调整绩效值(MRAP)，该模型以市场基准组合的系统性风险为基准，将被评价基金的风险水平调整到与该基准组合系统性风险持平，并以此来调整收益率以作为基金绩效评价标准 Muralidhar(2000)对 Sharpe 指数、信息率、2M 值进行了改进，并提出了 M³法。他认为以往的方法往往忽略了投资组合与市场基准投资组合之间的相关性，这样的评价是有偏的，因此排序也不具有一致性。因此，M³模型在进行评价时考虑了相关性差异及投资者风险偏好差异。Var Acharya 和 Pederson(2002)认为资产流动性依据时间变化而变化，因此提出了基于流动性的资本资产定价模型，并应用该模型来测度流动性风险对于绩效的影响 Mc Neil 和 Frey(2000)应用 GARCH 模型来评估资产收益率，并考虑了样本的厚尾性和异方差性，采用极值理论计算模型残差项的 VAR。风险调整资本报酬率（Risk-Ajusted Return on Capital, RAROC）也是近期以来受到广泛使用的绩效评估方法 Harvey 和 Siddique（2000）提出在进行投资者偏好描述时加入协偏度来衡量风险，作为传统均值方差模型的补充，并通过实证表明协偏度风险因子具有显著的负风险溢价。该模型特别在基金组合收益率呈现非正态分布时适合使 Hwang 和 Satchell（1999）也指出资产的系统协峰度具有显著风险溢价，因此，在进行资产收益率评价时应该在模型中加入该变量。Alexandros Kostakis（2008）指出在 Kimball（1993）的效用推导框架下，已经确保了投资者对于存在负协偏度风险因素的考虑，更适合投资者对于绩效评价的合理性 二、 基金绩效评价业的发展现状国外 一类是公司业务仅限定在基金绩效评价服务上，代表公司是晨星公司； 第二类的主营业务是提供基金信息及数据服务，其代表公司是全球基金分析公司和 Lipper公司； 最后一类其主营业务实际上是资信评级机构，对于基金绩效的评价业务是其的一个主要业务分支，代表公司是标准普尔 Micropal 公司、穆迪公司和惠誉公司国内 中国基金绩效评价业具有划时代意义的是 2001 年 3 月，中国银河证券基金评价研究中心获中国证监会批准在《中国证券报》披露“基金净值增长率排行榜”，这是中国官方首次允许评价机构在主流媒体上披露相关信息。从此，我国基金评价业发展开始起步，多类机构均开始涉足这一行业 证券投资服务中介机构是另一类涉足这一领域的业内机构。如北京天相投顾公司所开展的基金绩效评价与基金市场评论服务，但其收费较高，因此所面对的多为高净值客户与机构客户 除证券投资相关行业外，最为关注基金绩效评价的金融行业是保险公司，由于保险公司是基金(特别是封闭式基金)的最大投资者，为确保在进行投资时能够依据更为科学合理的方法，因此各大保险公司都积极的开发相应的基金评价体系，如平安保险与晨星公司合作，助推晨星评价方法的本土化 三、 绩效评价 平均回报 ：平均回报为年度化的平均月几何回报，得出数据未必与过去一年实际年度回报相等 标准差：反映计算期内总回报率的波动幅度，即基金每月的总回报率相对于平均月回报率的偏差程 度，波动越大，标准差也越大 夏普比率：夏普比率是衡量基金风险调整后收益的指标之一， 反映了基金承担单位风险所获得的超额回 报率（ Excess Returns ），即基金总回报率高于同期无风险收益率的部分，一般情况下，该比率 越高，基金承担单位风险得到的超额回报率越高 晨星基金绩效评价体系包含基金投资风格分析、收益水平评价、星级评价以及评价报告等四项内容 投资风格分析：晨星体系将基金进行多层次分类，在分类基础上，晨星公司推出了晨星风格箱方法。依据基金投资股票的平均市值依次分为大盘股、中盘股与小盘股，并在此基础上根据股票的市盈率与市净率特点将股票划分为成长型、价值型与介于两者之间的混合型 标普 中信证券：是我国首个完整的基金绩效评价体系，该体系依据基金的实际运营结果进行评价，并依照基金投资的主要标的物的不同将基金分为五类：股票型基金、债券型基金、货币型基金、指数型基金和混合型基金。每一类的绩效评价在该类内独立进行 银河证券是我国历史最久的基金绩效评价机构 天相投顾基金绩效评价体系是我国金融服务公司评价体系的典型代表。天相体系包含基金风险调整收益评价（采用传统的詹森指数和 Stutzer指数）、基金经理投资能力评价、流动性风险评价以及投资风格评价 中国社科院金融研究所基金绩效评价体系是我国科研院校评价体系的典型代表。该评价体系包含基金风险调整收益、基金绩效归因分析、投资资金流动性评价、基金组合的投资风格判定以及基金的星级评价 总体上来说，我国基金绩效评价行业还处于起步阶段，无论是从评价方法还是评价思想，从本质上都在模仿和借鉴国外的成熟经验，并没有根据我国市场的特点形成一套适合我国基金市场实际情况的绩效评价方法，但我们认为随着我国市场特别是基金绩效评价行业的发展和不断完善，我国的基金绩效评价体系会有更为切实的发展 国内外绩效评价体系差异化的比较分析i. 基金评价期间长度不同ii. 基金评价方法不同 我国的基金绩效评价体系目前仅采用量化评价方法，且仅针对基金本身进行评价。国外：定量分析针对基金本身进行评价，而定性分析则针对基金管理公司和基金经理进行评价iii. 评价模式也存在差异 静态 动态 相对表现 阿尔法系数：是基金的实际收益和按照 β 系数计算的期望收益之间的差额。其计算方法 如下：超额收益是基金的收益减去无风险投资收益（在中国为 1 年期银行定期存款收益）； 期望 收益是贝塔系数 β 和市场收益的乘积， 反映基金由于市场整体变动而获得的收益；超额收益和期 望收益的差额即 α 系数 贝塔系数：贝塔系数衡量基金收益相对于业绩评价基准收益的总体波动性，是一个相对指标。β 越高， 意味着基金相对于业绩评价基准的波动性越大。 β 大于 1 ，则基金的波动性大于业绩评价基准 的波动性。反之亦然 R平方：是反映业绩基准的变动对基金表现的影响，影响程度以0至100计。如果R平方值等于100，表示基金回报的变动完全由业绩基准的变动所致；若R平方值等于35，即35%的基金回报可归因于业绩基准的变动。简言之，R平方值愈低，由业绩基准变动导致的基金业绩的变动便愈少。此外，R平方也可用来确定贝塔系数（β）或阿尔法系数（α）的准确性。一般而言，基金的R平方值愈高，其两个系数的准确性便愈高 四、 归因分析 T-M模型：对于基金择时与择股能力的研究始于 Treynor 和 Mazuy(1966)，在该文章中他们率先用计量经济学方法对基金经理的择时能力与择股能力进行分析，并建立了 T-M 模型该模型认为基金经理对于市场应当具有提前的预判能力，直接变现即使投资组合的值应当与市场表现正相关。实证结论表明研究期内的基金经理并不具有择时能力 H-M 模型：Henriksson 和 Merton(1981)在 T-M 模型基础上开发出了 H-M 模型 Chang 和 Lewellen(1984)在 H-M模型基础上又发展出了 C-L 模型，并对美国 1971 年起的连续 8 年 67 只基金月收益率进行了运算，他们也证实了基金经理不具备择时能力，同时还检验出不具备择股能力 Merton(1981)采用非参数检验模型来进行归因分析。模型的前提假设是基金经理能够依据市场来及时调整组合中风险资产与无风险资产的比例以达到平衡风险与收益的目标 Brison Barra 买这货冒这个风险, 到底值不值?”的比率 (回报/风险比.)”风险回报比”大概有两个作用:1. 进行资产之间(或基金经理)之间的对比2. 作为资产组合配比最优化算法的原函数 (objective function)单独来讲: 夏普比率 = (平均收益 - 国债利率)/波动率理论取值区间: 负无穷-正无穷实际常见取值区间: 再0左右晃荡用法: 越大越好通俗来讲: 平均净收益与平均波动率的比值非常过时的一个比率, 个人非常讨厌, 毁了很多代人, 能躲多远就躲多远吧… 詹森指数 = (平均收益 - 国债利率) - 股指同动率*(股指平均收益 - 国债利率)理论取值区间: 负无穷-正无穷实际常见取值区间: 再0左右晃荡用法: 越大越好通俗来讲: 这个数值代表了基金经理的”能力.” 如果股指暴涨, 你的资产组合也暴涨, 那是应该的, 不算你的能力, 只能算你的运气. 如果不管股指暴涨或者暴跌, 你的资产组合总能比股指多赚一点, 那证明你有”能力.” Omega比率 = 赚钱几率/赔钱几率理论取值区间: 0-正无穷实际常见取值区间: 0.8-2之间用法: 越大越好本人喜欢… Rachev比率 = 挣大钱的几率/赔大钱的几率理论取值区间: 0-正无穷实际常见取值区间: 0.5-1之间用法: 越大越好本人喜欢… STARR比率 = (平均收益 - 国债利率)/尾部风险理论取值区间: 负无穷-正无穷实际常见取值区间: 很广泛, 这也是STARR的缺点之一, 很难去横向比较不同类型资产用法: 越大越好比较喜欢, 只是不好用, 很难比较不同类型资产, 比如说债券和股票用STARR来比较, 肯定是债券永远比股票高, 因为债券尾部风险总是比股票小. 导致无法比较…###一些注意点 看好算这些比率所用的时间段, 就算是同一个资产, 用前五年算出来的和前两年算出来的截然不同 看好用的什么模型算, 大概有条件性和非条件性. 条件性模型会反映”实时”情况, 非条件性模型会反映”平均情况” 历史表现不代表任何未来表现, 在牛逼的夏普比率, 明天也能跌得像狗 投资很复杂, 不可能就看一个比率定乾坤. 做组合要看: 回报, 风险和资产之间的运动关系 不要太膜拜任何一个比率","link":"/2020/02/05/%E5%9F%BA%E9%87%91%E8%AF%84%E4%BB%B7%E7%BB%A9%E6%95%88%E5%BD%92%E5%9B%A0/"},{"title":"量化投资框架","text":"量化投资 选股 多因子模型：数据准备（去极值、标准化）、单因子测试、收益模型、风险模型、优化模型 事件驱动策略：预测事件方法（ 打分法 回归法） 择时（预测） 期货市场CTA :趋势明显的市场 大宗商品周期性 CTA Commodity Trading Advisor 商品投资交易顾问 规则性强：程序化交易 用一些常见的技术指标在一定时间 刻度上捕捉价格的上涨和下跌趋势， 趋势投机：理论基础-道氏理论：价格反应一切信息，价格以趋势方式运动，历史会重复 步骤：合适的标的（有足够的波动），捕捉的趋势级别：日内、短长，入场系统（Hans123\\海龟等），风险仓位管理，参数寻优，交易设定 股票择时 套利alpha套利:做多股票，做空投指，获取选股超额收益 统计套利：股票配对交易、期货跨期套利、跨品种跨市场套利 高频 网格交易法：资金运用效率低-&gt;估值预计初投位置 Note私募：alpha为主、cta为辅","link":"/2020/03/21/%E9%87%8F%E5%8C%96%E6%8A%95%E8%B5%84%E6%A1%86%E6%9E%B6/"},{"title":"致敬英雄 共悼逝者","text":"烈士英灵不远，我们当秉承遗志，奋斗不息。 愿山河无恙，盛世安稳。","link":"/2020/04/04/%E8%87%B4%E6%95%AC%E8%8B%B1%E9%9B%84%20%E5%85%B1%E6%82%BC%E9%80%9D%E8%80%85/"}],"tags":[{"name":"其他","slug":"其他","link":"/tags/%E5%85%B6%E4%BB%96/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"数据库","slug":"数据库","link":"/tags/%E6%95%B0%E6%8D%AE%E5%BA%93/"},{"name":"量化","slug":"量化","link":"/tags/%E9%87%8F%E5%8C%96/"},{"name":"生活","slug":"生活","link":"/tags/%E7%94%9F%E6%B4%BB/"}],"categories":[{"name":"技术","slug":"技术","link":"/categories/%E6%8A%80%E6%9C%AF/"},{"name":"金融","slug":"金融","link":"/categories/%E9%87%91%E8%9E%8D/"},{"name":"生活","slug":"生活","link":"/categories/%E7%94%9F%E6%B4%BB/"}]}